fangchuan/HexRobot/User/bsp_stm32f4xx/src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*	函 数 名: fputc
*	功能说明: 重定义putc函数，这样可以使用printf函数从串口1打印输出
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int fputc(int ch, FILE *f)
{
#if 0	/* 将需要printf的字符通过串口中断FIFO发送出去，printf函数会立即返回 */
	comSendChar(COM1, ch);

	return ch;
#else	/* 采用阻塞方式发送每个字符,等待数据发送完毕 */
	/* 写一个字节到USART1 */
	USART_SendData(USART1, (uint8_t) ch);

	/* 等待发送结束 */
	while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
	{}

	return ch;
#endif
}

/*
*********************************************************************************************************
*	函 数 名: fgetc
*	功能说明: 重定义getc函数，这样可以使用getchar函数从串口1输入数据
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
int fgetc(FILE *f)
{

#if 0	/* 从串口接收FIFO中取1个数据, 只有取到数据才返回 */
	uint8_t ucData;

	while(comGetChar(COM1, &ucData) == 0);

	return ucData;
#else
	/* 等待串口1输入数据 */
	while (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == RESET);

	return (int)USART_ReceiveData(USART1);
#endif
}

/*
*********************************************************************************************************
*	函 数 名: get_order_from_uart
*	功能说明: 从接收缓冲区获取最先入队的一帧命令
*	形    参: 无
*	返 回 值: 返回0说明接收命令帧成功， -1说明接收命令帧出错
*********************************************************************************************************
*/
int get_order_from_uart(uint8_t *order)
{
	   uint16_t i ;
		 uint8_t  ch = 0;
	   uint16_t length;
	
		 for(i = 0; ; i ++)
		{
			  if(UartGetChar(&g_tUart1, &ch))
				{//成功读取到数据
					order[i] = ch;
					if(ch == PROTOCOL_END)
						break;
			  }
				else
				{
					return -1;
				}
		}
		 length = order[PROTOCOL_LENGTH_BIT];
	   if(order[0] != PROTOCOL_STX || order[length-1] != PROTOCOL_END)
		 {//错误帧，丢弃
			 return -1;
		 }
		 else
			 return  0;
}


/***************************** 阿波罗科技 www.apollorobot.com (END OF FILE) *********************************/
